#+TITLE: requests-module
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: ./post
#+HUGO_CATEGORIES: python
#+HUGO_TAGS: requests
#+DATE:<2019-02-11 Mon> 
#+HUGO_WEIGHT: 2001
#+HUGO_MENU: :menu "main" "weight 2001
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_CUSTOM_FRONT_MATTER: :foo bar

** quick start
   #+BEGIN_SRC python :results output :session
     import requests
     r = requests.put('https://httpbin.org/put',data={'key1':'value1'})
     print(r.status_code)
   #+END_SRC

   #+RESULTS:
   : 200

*** JSON响应内容
   requests模块里面存在着内置的JSON解码器

#+BEGIN_SRC python :results output :session
  r = requests.get("https://api.github.com/events")
  print(r.json())
#+END_SRC

#+RESULTS:
: [{'id': '9088908910', 'type': 'PushEvent', 'actor': {'id': 743122, 'login': 'cundd', 'display_login': 'cundd', 'gravatar_id': '', 'url': 'https://api.github.com/users/cundd', 'avatar_url': 'https://avatars.githubusercontent.com/u/743122?'}, 'repo': {'id': 10109604, 'name': 'cundd/rest', 'url': 'https://api.github.com/repos/cundd/rest'}, 'payload': {'push_id': 3317993922, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/v4', 'head': '0c6b187699f856d95557b35185860d1393b2510a', 'before': 'cf5d6b31a2ce235e3cac5da4cf3e78d8ccd55e07', 'commits': [{'sha': '0c6b187699f856d95557b35185860d1393b2510a', 'author': {'email': 'cod@iresults.li', 'name': 'Daniel Corn'}, 'message': 'Fix a PHP warning', 'distinct': True, 'url': 'https://api.github.com/repos/cundd/rest/commits/0c6b187699f856d95557b35185860d1393b2510a'}]}, 'public': True, 'created_at': '2019-02-18T17:24:41Z'}, {'id': '9088908908', 'type': 'PushEvent', 'actor': {'id': 844306, 'login': 'bendichter', 'display_login': 'bendichter', 'gravatar_id': '', 'url': 'https://api.github.com/users/bendichter', 'avatar_url': 'https://avatars.githubusercontent.com/u/844306?'}, 'repo': {'id': 99273369, 'name': 'NeurodataWithoutBorders/pynwb', 'url': 'https://api.github.com/repos/NeurodataWithoutBorders/pynwb'}, 'payload': {'push_id': 3317993921, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/fix/electrode_group_col', 'head': '0acf004800fae4faa4b8ef58d457a4e855702675', 'before': '345f76ea287e24276295c9f8ede10277f995281b', 'commits': [{'sha': '0acf004800fae4faa4b8ef58d457a4e855702675', 'author': {'email': 'ben.dichter@gmail.com', 'name': 'bendichter'}, 'message': 'add test for electrode_group column in Units table', 'distinct': True, 'url': 'https://api.github.com/repos/NeurodataWithoutBorders/pynwb/commits/0acf004800fae4faa4b8ef58d457a4e855702675'}]}, 'public': True, 'created_at': '2019-02-18T17:24:41Z', 'org': {'id': 12140348, 'login': 'NeurodataWithoutBorders', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/NeurodataWithoutBorders', 'avatar_url': 'https://avatars.githubusercontent.com/u/12140348?'}}, {'id': '9088908905', 'type': 'PushEvent', 'actor': {'id': 5108069, 'login': 'elazarg', 'display_login': 'elazarg', 'gravatar_id': '', 'url': 'https://api.github.com/users/elazarg', 'avatar_url': 'https://avatars.githubusercontent.com/u/5108069?'}, 'repo': {'id': 137548993, 'name': 'elazarg/ebpf-verifier', 'url': 'https://api.github.com/repos/elazarg/ebpf-verifier'}, 'payload': {'push_id': 3317993919, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/submission', 'head': '4ef36dcbb121d2fb4bd82a33bd64bc40de313da4', 'before': 'bf0e05dfa138be2fe8f62dd6efe9705432daf046', 'commits': [{'sha': '4ef36dcbb121d2fb4bd82a33bd64bc40de313da4', 'author': {'email': 'elazarg@gmail.com', 'name': 'Elazar Gershuni'}, 'message': 'the linux way', 'distinct': True, 'url': 'https://api.github.com/repos/elazarg/ebpf-verifier/commits/4ef36dcbb121d2fb4bd82a33bd64bc40de313da4'}]}, 'public': True, 'created_at': '2019-02-18T17:24:41Z'}, {'id': '9088908906', 'type': 'PullRequestEvent', 'actor': {'id': 1656595, 'login': 'hellocosmin', 'display_login': 'hellocosmin', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'avatar_url': 'https://avatars.githubusercontent.com/u/1656595?'}, 'repo': {'id': 171323832, 'name': 'hellocosmin/artisan-static', 'url': 'https://api.github.com/repos/hellocosmin/artisan-static'}, 'payload': {'action': 'opened', 'number': 2, 'pull_request': {'url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2', 'id': 253994092, 'node_id': 'MDExOlB1bGxSZXF1ZXN0MjUzOTk0MDky', 'html_url': 'https://github.com/hellocosmin/artisan-static/pull/2', 'diff_url': 'https://github.com/hellocosmin/artisan-static/pull/2.diff', 'patch_url': 'https://github.com/hellocosmin/artisan-static/pull/2.patch', 'issue_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/2', 'number': 2, 'state': 'open', 'locked': False, 'title': 'Update Posts “cloudinary-image-hosting”', 'user': {'login': 'hellocosmin', 'id': 1656595, 'node_id': 'MDQ6VXNlcjE2NTY1OTU=', 'avatar_url': 'https://avatars3.githubusercontent.com/u/1656595?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'html_url': 'https://github.com/hellocosmin', 'followers_url': 'https://api.github.com/users/hellocosmin/followers', 'following_url': 'https://api.github.com/users/hellocosmin/following{/other_user}', 'gists_url': 'https://api.github.com/users/hellocosmin/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/hellocosmin/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/hellocosmin/subscriptions', 'organizations_url': 'https://api.github.com/users/hellocosmin/orgs', 'repos_url': 'https://api.github.com/users/hellocosmin/repos', 'events_url': 'https://api.github.com/users/hellocosmin/events{/privacy}', 'received_events_url': 'https://api.github.com/users/hellocosmin/received_events', 'type': 'User', 'site_admin': False}, 'body': 'Automatically generated by Netlify CMS', 'created_at': '2019-02-18T17:24:40Z', 'updated_at': '2019-02-18T17:24:40Z', 'closed_at': None, 'merged_at': None, 'merge_commit_sha': None, 'assignee': None, 'assignees': [], 'requested_reviewers': [], 'requested_teams': [], 'labels': [], 'milestone': None, 'commits_url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2/commits', 'review_comments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2/comments', 'review_comment_url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/comments{/number}', 'comments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/2/comments', 'statuses_url': 'https://api.github.com/repos/hellocosmin/artisan-static/statuses/ffa3c9f2e345d7271821da0c3bef4d7a097ab979', 'head': {'label': 'hellocosmin:undefined/cloudinary-image-hosting', 'ref': 'undefined/cloudinary-image-hosting', 'sha': 'ffa3c9f2e345d7271821da0c3bef4d7a097ab979', 'user': {'login': 'hellocosmin', 'id': 1656595, 'node_id': 'MDQ6VXNlcjE2NTY1OTU=', 'avatar_url': 'https://avatars3.githubusercontent.com/u/1656595?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'html_url': 'https://github.com/hellocosmin', 'followers_url': 'https://api.github.com/users/hellocosmin/followers', 'following_url': 'https://api.github.com/users/hellocosmin/following{/other_user}', 'gists_url': 'https://api.github.com/users/hellocosmin/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/hellocosmin/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/hellocosmin/subscriptions', 'organizations_url': 'https://api.github.com/users/hellocosmin/orgs', 'repos_url': 'https://api.github.com/users/hellocosmin/repos', 'events_url': 'https://api.github.com/users/hellocosmin/events{/privacy}', 'received_events_url': 'https://api.github.com/users/hellocosmin/received_events', 'type': 'User', 'site_admin': False}, 'repo': {'id': 171323832, 'node_id': 'MDEwOlJlcG9zaXRvcnkxNzEzMjM4MzI=', 'name': 'artisan-static', 'full_name': 'hellocosmin/artisan-static', 'private': False, 'owner': {'login': 'hellocosmin', 'id': 1656595, 'node_id': 'MDQ6VXNlcjE2NTY1OTU=', 'avatar_url': 'https://avatars3.githubusercontent.com/u/1656595?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'html_url': 'https://github.com/hellocosmin', 'followers_url': 'https://api.github.com/users/hellocosmin/followers', 'following_url': 'https://api.github.com/users/hellocosmin/following{/other_user}', 'gists_url': 'https://api.github.com/users/hellocosmin/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/hellocosmin/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/hellocosmin/subscriptions', 'organizations_url': 'https://api.github.com/users/hellocosmin/orgs', 'repos_url': 'https://api.github.com/users/hellocosmin/repos', 'events_url': 'https://api.github.com/users/hellocosmin/events{/privacy}', 'received_events_url': 'https://api.github.com/users/hellocosmin/received_events', 'type': 'User', 'site_admin': False}, 'html_url': 'https://github.com/hellocosmin/artisan-static', 'description': None, 'fork': False, 'url': 'https://api.github.com/repos/hellocosmin/artisan-static', 'forks_url': 'https://api.github.com/repos/hellocosmin/artisan-static/forks', 'keys_url': 'https://api.github.com/repos/hellocosmin/artisan-static/keys{/key_id}', 'collaborators_url': 'https://api.github.com/repos/hellocosmin/artisan-static/collaborators{/collaborator}', 'teams_url': 'https://api.github.com/repos/hellocosmin/artisan-static/teams', 'hooks_url': 'https://api.github.com/repos/hellocosmin/artisan-static/hooks', 'issue_events_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/events{/number}', 'events_url': 'https://api.github.com/repos/hellocosmin/artisan-static/events', 'assignees_url': 'https://api.github.com/repos/hellocosmin/artisan-static/assignees{/user}', 'branches_url': 'https://api.github.com/repos/hellocosmin/artisan-static/branches{/branch}', 'tags_url': 'https://api.github.com/repos/hellocosmin/artisan-static/tags', 'blobs_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/blobs{/sha}', 'git_tags_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/tags{/sha}', 'git_refs_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/refs{/sha}', 'trees_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/trees{/sha}', 'statuses_url': 'https://api.github.com/repos/hellocosmin/artisan-static/statuses/{sha}', 'languages_url': 'https://api.github.com/repos/hellocosmin/artisan-static/languages', 'stargazers_url': 'https://api.github.com/repos/hellocosmin/artisan-static/stargazers', 'contributors_url': 'https://api.github.com/repos/hellocosmin/artisan-static/contributors', 'subscribers_url': 'https://api.github.com/repos/hellocosmin/artisan-static/subscribers', 'subscription_url': 'https://api.github.com/repos/hellocosmin/artisan-static/subscription', 'commits_url': 'https://api.github.com/repos/hellocosmin/artisan-static/commits{/sha}', 'git_commits_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/commits{/sha}', 'comments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/comments{/number}', 'issue_comment_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/comments{/number}', 'contents_url': 'https://api.github.com/repos/hellocosmin/artisan-static/contents/{+path}', 'compare_url': 'https://api.github.com/repos/hellocosmin/artisan-static/compare/{base}...{head}', 'merges_url': 'https://api.github.com/repos/hellocosmin/artisan-static/merges', 'archive_url': 'https://api.github.com/repos/hellocosmin/artisan-static/{archive_format}{/ref}', 'downloads_url': 'https://api.github.com/repos/hellocosmin/artisan-static/downloads', 'issues_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues{/number}', 'pulls_url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls{/number}', 'milestones_url': 'https://api.github.com/repos/hellocosmin/artisan-static/milestones{/number}', 'notifications_url': 'https://api.github.com/repos/hellocosmin/artisan-static/notifications{?since,all,participating}', 'labels_url': 'https://api.github.com/repos/hellocosmin/artisan-static/labels{/name}', 'releases_url': 'https://api.github.com/repos/hellocosmin/artisan-static/releases{/id}', 'deployments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/deployments', 'created_at': '2019-02-18T17:08:15Z', 'updated_at': '2019-02-18T17:24:16Z', 'pushed_at': '2019-02-18T17:24:40Z', 'git_url': 'git://github.com/hellocosmin/artisan-static.git', 'ssh_url': 'git@github.com:hellocosmin/artisan-static.git', 'clone_url': 'https://github.com/hellocosmin/artisan-static.git', 'svn_url': 'https://github.com/hellocosmin/artisan-static', 'homepage': None, 'size': 0, 'stargazers_count': 0, 'watchers_count': 0, 'language': 'HTML', 'has_issues': True, 'has_projects': True, 'has_downloads': True, 'has_wiki': True, 'has_pages': False, 'forks_count': 0, 'mirror_url': None, 'archived': False, 'open_issues_count': 1, 'license': None, 'forks': 0, 'open_issues': 1, 'watchers': 0, 'default_branch': 'master'}}, 'base': {'label': 'hellocosmin:master', 'ref': 'master', 'sha': 'e223f65e3b2fe30e4c907c1f22096fdaa81a734b', 'user': {'login': 'hellocosmin', 'id': 1656595, 'node_id': 'MDQ6VXNlcjE2NTY1OTU=', 'avatar_url': 'https://avatars3.githubusercontent.com/u/1656595?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'html_url': 'https://github.com/hellocosmin', 'followers_url': 'https://api.github.com/users/hellocosmin/followers', 'following_url': 'https://api.github.com/users/hellocosmin/following{/other_user}', 'gists_url': 'https://api.github.com/users/hellocosmin/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/hellocosmin/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/hellocosmin/subscriptions', 'organizations_url': 'https://api.github.com/users/hellocosmin/orgs', 'repos_url': 'https://api.github.com/users/hellocosmin/repos', 'events_url': 'https://api.github.com/users/hellocosmin/events{/privacy}', 'received_events_url': 'https://api.github.com/users/hellocosmin/received_events', 'type': 'User', 'site_admin': False}, 'repo': {'id': 171323832, 'node_id': 'MDEwOlJlcG9zaXRvcnkxNzEzMjM4MzI=', 'name': 'artisan-static', 'full_name': 'hellocosmin/artisan-static', 'private': False, 'owner': {'login': 'hellocosmin', 'id': 1656595, 'node_id': 'MDQ6VXNlcjE2NTY1OTU=', 'avatar_url': 'https://avatars3.githubusercontent.com/u/1656595?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'html_url': 'https://github.com/hellocosmin', 'followers_url': 'https://api.github.com/users/hellocosmin/followers', 'following_url': 'https://api.github.com/users/hellocosmin/following{/other_user}', 'gists_url': 'https://api.github.com/users/hellocosmin/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/hellocosmin/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/hellocosmin/subscriptions', 'organizations_url': 'https://api.github.com/users/hellocosmin/orgs', 'repos_url': 'https://api.github.com/users/hellocosmin/repos', 'events_url': 'https://api.github.com/users/hellocosmin/events{/privacy}', 'received_events_url': 'https://api.github.com/users/hellocosmin/received_events', 'type': 'User', 'site_admin': False}, 'html_url': 'https://github.com/hellocosmin/artisan-static', 'description': None, 'fork': False, 'url': 'https://api.github.com/repos/hellocosmin/artisan-static', 'forks_url': 'https://api.github.com/repos/hellocosmin/artisan-static/forks', 'keys_url': 'https://api.github.com/repos/hellocosmin/artisan-static/keys{/key_id}', 'collaborators_url': 'https://api.github.com/repos/hellocosmin/artisan-static/collaborators{/collaborator}', 'teams_url': 'https://api.github.com/repos/hellocosmin/artisan-static/teams', 'hooks_url': 'https://api.github.com/repos/hellocosmin/artisan-static/hooks', 'issue_events_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/events{/number}', 'events_url': 'https://api.github.com/repos/hellocosmin/artisan-static/events', 'assignees_url': 'https://api.github.com/repos/hellocosmin/artisan-static/assignees{/user}', 'branches_url': 'https://api.github.com/repos/hellocosmin/artisan-static/branches{/branch}', 'tags_url': 'https://api.github.com/repos/hellocosmin/artisan-static/tags', 'blobs_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/blobs{/sha}', 'git_tags_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/tags{/sha}', 'git_refs_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/refs{/sha}', 'trees_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/trees{/sha}', 'statuses_url': 'https://api.github.com/repos/hellocosmin/artisan-static/statuses/{sha}', 'languages_url': 'https://api.github.com/repos/hellocosmin/artisan-static/languages', 'stargazers_url': 'https://api.github.com/repos/hellocosmin/artisan-static/stargazers', 'contributors_url': 'https://api.github.com/repos/hellocosmin/artisan-static/contributors', 'subscribers_url': 'https://api.github.com/repos/hellocosmin/artisan-static/subscribers', 'subscription_url': 'https://api.github.com/repos/hellocosmin/artisan-static/subscription', 'commits_url': 'https://api.github.com/repos/hellocosmin/artisan-static/commits{/sha}', 'git_commits_url': 'https://api.github.com/repos/hellocosmin/artisan-static/git/commits{/sha}', 'comments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/comments{/number}', 'issue_comment_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/comments{/number}', 'contents_url': 'https://api.github.com/repos/hellocosmin/artisan-static/contents/{+path}', 'compare_url': 'https://api.github.com/repos/hellocosmin/artisan-static/compare/{base}...{head}', 'merges_url': 'https://api.github.com/repos/hellocosmin/artisan-static/merges', 'archive_url': 'https://api.github.com/repos/hellocosmin/artisan-static/{archive_format}{/ref}', 'downloads_url': 'https://api.github.com/repos/hellocosmin/artisan-static/downloads', 'issues_url': 'https://api.github.com/repos/hellocosmin/artisan-static/issues{/number}', 'pulls_url': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls{/number}', 'milestones_url': 'https://api.github.com/repos/hellocosmin/artisan-static/milestones{/number}', 'notifications_url': 'https://api.github.com/repos/hellocosmin/artisan-static/notifications{?since,all,participating}', 'labels_url': 'https://api.github.com/repos/hellocosmin/artisan-static/labels{/name}', 'releases_url': 'https://api.github.com/repos/hellocosmin/artisan-static/releases{/id}', 'deployments_url': 'https://api.github.com/repos/hellocosmin/artisan-static/deployments', 'created_at': '2019-02-18T17:08:15Z', 'updated_at': '2019-02-18T17:24:16Z', 'pushed_at': '2019-02-18T17:24:40Z', 'git_url': 'git://github.com/hellocosmin/artisan-static.git', 'ssh_url': 'git@github.com:hellocosmin/artisan-static.git', 'clone_url': 'https://github.com/hellocosmin/artisan-static.git', 'svn_url': 'https://github.com/hellocosmin/artisan-static', 'homepage': None, 'size': 0, 'stargazers_count': 0, 'watchers_count': 0, 'language': 'HTML', 'has_issues': True, 'has_projects': True, 'has_downloads': True, 'has_wiki': True, 'has_pages': False, 'forks_count': 0, 'mirror_url': None, 'archived': False, 'open_issues_count': 1, 'license': None, 'forks': 0, 'open_issues': 1, 'watchers': 0, 'default_branch': 'master'}}, '_links': {'self': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2'}, 'html': {'href': 'https://github.com/hellocosmin/artisan-static/pull/2'}, 'issue': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/2'}, 'comments': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/issues/2/comments'}, 'review_comments': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2/comments'}, 'review_comment': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/comments{/number}'}, 'commits': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/pulls/2/commits'}, 'statuses': {'href': 'https://api.github.com/repos/hellocosmin/artisan-static/statuses/ffa3c9f2e345d7271821da0c3bef4d7a097ab979'}}, 'author_association': 'OWNER', 'merged': False, 'mergeable': None, 'rebaseable': None, 'mergeable_state': 'unknown', 'merged_by': None, 'comments': 0, 'review_comments': 0, 'maintainer_can_modify': False, 'commits': 1, 'additions': 0, 'deletions': 2, 'changed_files': 1}}, 'public': True, 'created_at': '2019-02-18T17:24:41Z'}, {'id': '9088908894', 'type': 'PushEvent', 'actor': {'id': 20360326, 'login': 'Okroshiashvili', 'display_login': 'Okroshiashvili', 'gravatar_id': '', 'url': 'https://api.github.com/users/Okroshiashvili', 'avatar_url': 'https://avatars.githubusercontent.com/u/20360326?'}, 'repo': {'id': 130345437, 'name': 'Okroshiashvili/Data-Science-Lab', 'url': 'https://api.github.com/repos/Okroshiashvili/Data-Science-Lab'}, 'payload': {'push_id': 3317993913, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '32dc9f7e9c9da0cfe813d89bf414f837bc07c868', 'before': '74981c38056892b26bfb679f81d1dfcd165faad0', 'commits': [{'sha': '32dc9f7e9c9da0cfe813d89bf414f837bc07c868', 'author': {'email': 'n.okroshiashvili@gmail.com', 'name': 'Okroshiashvili'}, 'message': 'Update Readme', 'distinct': True, 'url': 'https://api.github.com/repos/Okroshiashvili/Data-Science-Lab/commits/32dc9f7e9c9da0cfe813d89bf414f837bc07c868'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908888', 'type': 'PushEvent', 'actor': {'id': 44526727, 'login': 'PrepConcedeITIS', 'display_login': 'PrepConcedeITIS', 'gravatar_id': '', 'url': 'https://api.github.com/users/PrepConcedeITIS', 'avatar_url': 'https://avatars.githubusercontent.com/u/44526727?'}, 'repo': {'id': 171014952, 'name': 'PrepConcedeITIS/16.02.19', 'url': 'https://api.github.com/repos/PrepConcedeITIS/16.02.19'}, 'payload': {'push_id': 3317993907, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': 'e0b112958abe90df4bce41a066c2746ac2965169', 'before': '6b913c9401166b90792332683bfa03f991d76b06', 'commits': [{'sha': 'e0b112958abe90df4bce41a066c2746ac2965169', 'author': {'email': '44526727+PrepConcedeITIS@users.noreply.github.com', 'name': 'PrepConcedeITIS'}, 'message': 'tests', 'distinct': True, 'url': 'https://api.github.com/repos/PrepConcedeITIS/16.02.19/commits/e0b112958abe90df4bce41a066c2746ac2965169'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908886', 'type': 'PushEvent', 'actor': {'id': 314697, 'login': 'gautiermichelin', 'display_login': 'gautiermichelin', 'gravatar_id': '', 'url': 'https://api.github.com/users/gautiermichelin', 'avatar_url': 'https://avatars.githubusercontent.com/u/314697?'}, 'repo': {'id': 171325987, 'name': 'ideesculture/ca_pactols', 'url': 'https://api.github.com/repos/ideesculture/ca_pactols'}, 'payload': {'push_id': 3317993909, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '1fe19706c0844c0d1f11012a48f1cc0a9d42add9', 'before': '555f6092e2387d9d4b21acba1c7e7b226dd4aeed', 'commits': [{'sha': '1fe19706c0844c0d1f11012a48f1cc0a9d42add9', 'author': {'email': 'gm@ideesculture.com', 'name': 'Gautier Michelin'}, 'message': 'first commit', 'distinct': True, 'url': 'https://api.github.com/repos/ideesculture/ca_pactols/commits/1fe19706c0844c0d1f11012a48f1cc0a9d42add9'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 1758566, 'login': 'ideesculture', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/ideesculture', 'avatar_url': 'https://avatars.githubusercontent.com/u/1758566?'}}, {'id': '9088908885', 'type': 'PushEvent', 'actor': {'id': 8517910, 'login': 'LombiqBot', 'display_login': 'LombiqBot', 'gravatar_id': '', 'url': 'https://api.github.com/users/LombiqBot', 'avatar_url': 'https://avatars.githubusercontent.com/u/8517910?'}, 'repo': {'id': 46629104, 'name': 'Lombiq/Orchard-Scripting-Extensions-JavaScript', 'url': 'https://api.github.com/repos/Lombiq/Orchard-Scripting-Extensions-JavaScript'}, 'payload': {'push_id': 3317993910, 'size': 0, 'distinct_size': 0, 'ref': 'refs/heads/orchard-upgrade-1.9.1', 'head': 'ad45854f1c203888c670a903bee3b0f8fa7d4ae0', 'before': 'ad45854f1c203888c670a903bee3b0f8fa7d4ae0', 'commits': []}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 8158177, 'login': 'Lombiq', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/Lombiq', 'avatar_url': 'https://avatars.githubusercontent.com/u/8158177?'}}, {'id': '9088908883', 'type': 'PushEvent', 'actor': {'id': 294293, 'login': 'BtbN', 'display_login': 'BtbN', 'gravatar_id': '', 'url': 'https://api.github.com/users/BtbN', 'avatar_url': 'https://avatars.githubusercontent.com/u/294293?'}, 'repo': {'id': 60558385, 'name': 'esamarathon/esacontroller', 'url': 'https://api.github.com/repos/esamarathon/esacontroller'}, 'payload': {'push_id': 3317993906, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '372258f01a425f510a00cf5b0b68ec25653a1bae', 'before': '51b918a3fa9acfdedb801698e45211ba112ba57a', 'commits': [{'sha': '372258f01a425f510a00cf5b0b68ec25653a1bae', 'author': {'email': 'btbn@btbn.de', 'name': 'BtbN'}, 'message': 'player.twitch -> player.social.twitch', 'distinct': True, 'url': 'https://api.github.com/repos/esamarathon/esacontroller/commits/372258f01a425f510a00cf5b0b68ec25653a1bae'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 29999483, 'login': 'esamarathon', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/esamarathon', 'avatar_url': 'https://avatars.githubusercontent.com/u/29999483?'}}, {'id': '9088908877', 'type': 'PushEvent', 'actor': {'id': 29139614, 'login': 'renovate[bot]', 'display_login': 'renovate', 'gravatar_id': '', 'url': 'https://api.github.com/users/renovate[bot]', 'avatar_url': 'https://avatars.githubusercontent.com/u/29139614?'}, 'repo': {'id': 154339811, 'name': 'mozilla/extension-workshop', 'url': 'https://api.github.com/repos/mozilla/extension-workshop'}, 'payload': {'push_id': 3317993902, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/renovate/eslint-5.x', 'head': '01c0313987742009a16ed0f6170dafb2178dc2bd', 'before': '6b81a7d43e66986723eba163bba22476a1198df3', 'commits': [{'sha': '01c0313987742009a16ed0f6170dafb2178dc2bd', 'author': {'email': 'bot@renovateapp.com', 'name': 'Renovate Bot'}, 'message': 'Update dependency eslint to v5.14.1', 'distinct': True, 'url': 'https://api.github.com/repos/mozilla/extension-workshop/commits/01c0313987742009a16ed0f6170dafb2178dc2bd'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 131524, 'login': 'mozilla', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/mozilla', 'avatar_url': 'https://avatars.githubusercontent.com/u/131524?'}}, {'id': '9088908878', 'type': 'PushEvent', 'actor': {'id': 35800071, 'login': 'ShiliXu1997', 'display_login': 'ShiliXu1997', 'gravatar_id': '', 'url': 'https://api.github.com/users/ShiliXu1997', 'avatar_url': 'https://avatars.githubusercontent.com/u/35800071?'}, 'repo': {'id': 171325858, 'name': 'ShiliXu1997/YimHoo', 'url': 'https://api.github.com/repos/ShiliXu1997/YimHoo'}, 'payload': {'push_id': 3317993900, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '2e9304b9520bf98afc9ba6f644ce241c2210ffb5', 'before': '6595bf915848422da00747ed327f3b88b4a724c8', 'commits': [{'sha': '2e9304b9520bf98afc9ba6f644ce241c2210ffb5', 'author': {'email': '627574549@qq.com', 'name': 'ShiliXu1997'}, 'message': '构建了最初的界面', 'distinct': True, 'url': 'https://api.github.com/repos/ShiliXu1997/YimHoo/commits/2e9304b9520bf98afc9ba6f644ce241c2210ffb5'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908875', 'type': 'PushEvent', 'actor': {'id': 211411, 'login': 'gre', 'display_login': 'gre', 'gravatar_id': '', 'url': 'https://api.github.com/users/gre', 'avatar_url': 'https://avatars.githubusercontent.com/u/211411?'}, 'repo': {'id': 116654890, 'name': 'LedgerHQ/ledger-live-mobile', 'url': 'https://api.github.com/repos/LedgerHQ/ledger-live-mobile'}, 'payload': {'push_id': 3317993899, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/l10n_develop', 'head': '1379ca704af03b032ffea886455b9c3eaf844d8b', 'before': '55932077992645330b1c34b981c867198964893c', 'commits': [{'sha': '1379ca704af03b032ffea886455b9c3eaf844d8b', 'author': {'email': 'renaudeau.gaetan@gmail.com', 'name': 'Gaëtan Renaudeau'}, 'message': 'New translations common.json (Russian)', 'distinct': True, 'url': 'https://api.github.com/repos/LedgerHQ/ledger-live-mobile/commits/1379ca704af03b032ffea886455b9c3eaf844d8b'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 9784193, 'login': 'LedgerHQ', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/LedgerHQ', 'avatar_url': 'https://avatars.githubusercontent.com/u/9784193?'}}, {'id': '9088908867', 'type': 'PushEvent', 'actor': {'id': 15165030, 'login': 'RamyAllam', 'display_login': 'RamyAllam', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'avatar_url': 'https://avatars.githubusercontent.com/u/15165030?'}, 'repo': {'id': 171325045, 'name': 'RamyAllam/devops-essentials-sample-app', 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app'}, 'payload': {'push_id': 3317993896, 'size': 2, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': 'ba255c61a1860553d45af7e71fec3a591a7564c4', 'before': 'dc95c531307bb3df387145a7b93a6f2e9ad0a872', 'commits': [{'sha': '02fc50084a6483f16828fcc98c0a086797d0d764', 'author': {'email': 'willb@linuxacademy.com', 'name': 'willb'}, 'message': 'change text to state that devops is awesome', 'distinct': False, 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/commits/02fc50084a6483f16828fcc98c0a086797d0d764'}, {'sha': 'ba255c61a1860553d45af7e71fec3a591a7564c4', 'author': {'email': 'linux@ramyallam.com', 'name': 'Ramy Allam'}, 'message': 'Merge pull request #1 from RamyAllam/new-feature\n\nchange text to state that devops is awesome', 'distinct': True, 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/commits/ba255c61a1860553d45af7e71fec3a591a7564c4'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908859', 'type': 'IssueCommentEvent', 'actor': {'id': 632353, 'login': 'paddelboot', 'display_login': 'paddelboot', 'gravatar_id': '', 'url': 'https://api.github.com/users/paddelboot', 'avatar_url': 'https://avatars.githubusercontent.com/u/632353?'}, 'repo': {'id': 1367484, 'name': 'Behat/Behat', 'url': 'https://api.github.com/repos/Behat/Behat'}, 'payload': {'action': 'created', 'issue': {'url': 'https://api.github.com/repos/Behat/Behat/issues/1207', 'repository_url': 'https://api.github.com/repos/Behat/Behat', 'labels_url': 'https://api.github.com/repos/Behat/Behat/issues/1207/labels{/name}', 'comments_url': 'https://api.github.com/repos/Behat/Behat/issues/1207/comments', 'events_url': 'https://api.github.com/repos/Behat/Behat/issues/1207/events', 'html_url': 'https://github.com/Behat/Behat/issues/1207', 'id': 411508668, 'node_id': 'MDU6SXNzdWU0MTE1MDg2Njg=', 'number': 1207, 'title': 'Using PHPUnit expectations in @Then step?', 'user': {'login': 'paddelboot', 'id': 632353, 'node_id': 'MDQ6VXNlcjYzMjM1Mw==', 'avatar_url': 'https://avatars2.githubusercontent.com/u/632353?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/paddelboot', 'html_url': 'https://github.com/paddelboot', 'followers_url': 'https://api.github.com/users/paddelboot/followers', 'following_url': 'https://api.github.com/users/paddelboot/following{/other_user}', 'gists_url': 'https://api.github.com/users/paddelboot/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/paddelboot/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/paddelboot/subscriptions', 'organizations_url': 'https://api.github.com/users/paddelboot/orgs', 'repos_url': 'https://api.github.com/users/paddelboot/repos', 'events_url': 'https://api.github.com/users/paddelboot/events{/privacy}', 'received_events_url': 'https://api.github.com/users/paddelboot/received_events', 'type': 'User', 'site_admin': False}, 'labels': [], 'state': 'open', 'locked': False, 'assignee': None, 'assignees': [], 'milestone': None, 'comments': 1, 'created_at': '2019-02-18T14:43:50Z', 'updated_at': '2019-02-18T17:24:40Z', 'closed_at': None, 'author_association': 'NONE', 'body': "There are examples in the Behat documentation that show how to use PHPUnit assertions in the @Then step. What if I don't expect some object property to be set, but instead, a method being called, like `sendEmail()`?\r\n\r\nWhat I tried:\r\n\r\n    /**\r\n     * @Then an offer to download the ebook must be sent via email\r\n     */\r\n    public function anOfferToDownloadEbookMustBeSentViaEmail( $arg1 ) {\r\n\r\n        $this->Lead->expects( TestCase::once() )->method( 'send' )->with( TestCase::equalTo( 'ebook' ) );\r\n\r\n        $this->Lead->isEligibleForNextDigitalProduct();\r\n    }\r\n\r\nBut even though `send` is never called in my `Lead::isEligibleForNextDigitalProduct` method, the test passes. If I do some nonsense assertion like 1 equals 2, I do get the expected error message. Did I misunderstand something?"}, 'comment': {'url': 'https://api.github.com/repos/Behat/Behat/issues/comments/464818513', 'html_url': 'https://github.com/Behat/Behat/issues/1207#issuecomment-464818513', 'issue_url': 'https://api.github.com/repos/Behat/Behat/issues/1207', 'id': 464818513, 'node_id': 'MDEyOklzc3VlQ29tbWVudDQ2NDgxODUxMw==', 'user': {'login': 'paddelboot', 'id': 632353, 'node_id': 'MDQ6VXNlcjYzMjM1Mw==', 'avatar_url': 'https://avatars2.githubusercontent.com/u/632353?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/paddelboot', 'html_url': 'https://github.com/paddelboot', 'followers_url': 'https://api.github.com/users/paddelboot/followers', 'following_url': 'https://api.github.com/users/paddelboot/following{/other_user}', 'gists_url': 'https://api.github.com/users/paddelboot/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/paddelboot/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/paddelboot/subscriptions', 'organizations_url': 'https://api.github.com/users/paddelboot/orgs', 'repos_url': 'https://api.github.com/users/paddelboot/repos', 'events_url': 'https://api.github.com/users/paddelboot/events{/privacy}', 'received_events_url': 'https://api.github.com/users/paddelboot/received_events', 'type': 'User', 'site_admin': False}, 'created_at': '2019-02-18T17:24:40Z', 'updated_at': '2019-02-18T17:24:40Z', 'author_association': 'NONE', 'body': 'Thanks for the hint. Does it maybe make more sense to use something like Mailtrap - because all I do here is to check that a method was called, but the behaviour I really want to test via BDD/Behat is whether an email is sent.'}}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 547869, 'login': 'Behat', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/Behat', 'avatar_url': 'https://avatars.githubusercontent.com/u/547869?'}}, {'id': '9088908853', 'type': 'PushEvent', 'actor': {'id': 8517910, 'login': 'LombiqBot', 'display_login': 'LombiqBot', 'gravatar_id': '', 'url': 'https://api.github.com/users/LombiqBot', 'avatar_url': 'https://avatars.githubusercontent.com/u/8517910?'}, 'repo': {'id': 46595455, 'name': 'Lombiq/Orchard-Avatars', 'url': 'https://api.github.com/repos/Lombiq/Orchard-Avatars'}, 'payload': {'push_id': 3317993887, 'size': 0, 'distinct_size': 0, 'ref': 'refs/heads/dev', 'head': 'ebb0efbf1eace8e9a89f9af6afe9ede4cab1d491', 'before': 'ebb0efbf1eace8e9a89f9af6afe9ede4cab1d491', 'commits': []}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 8158177, 'login': 'Lombiq', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/Lombiq', 'avatar_url': 'https://avatars.githubusercontent.com/u/8158177?'}}, {'id': '9088908854', 'type': 'CreateEvent', 'actor': {'id': 1656595, 'login': 'hellocosmin', 'display_login': 'hellocosmin', 'gravatar_id': '', 'url': 'https://api.github.com/users/hellocosmin', 'avatar_url': 'https://avatars.githubusercontent.com/u/1656595?'}, 'repo': {'id': 171323832, 'name': 'hellocosmin/artisan-static', 'url': 'https://api.github.com/repos/hellocosmin/artisan-static'}, 'payload': {'ref': 'undefined/cloudinary-image-hosting', 'ref_type': 'branch', 'master_branch': 'master', 'description': None, 'pusher_type': 'user'}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908851', 'type': 'IssueCommentEvent', 'actor': {'id': 15204269, 'login': 'kvasukib', 'display_login': 'kvasukib', 'gravatar_id': '', 'url': 'https://api.github.com/users/kvasukib', 'avatar_url': 'https://avatars.githubusercontent.com/u/15204269?'}, 'repo': {'id': 21634100, 'name': 'aws-amplify/aws-sdk-android', 'url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android'}, 'payload': {'action': 'created', 'issue': {'url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/709', 'repository_url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android', 'labels_url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/709/labels{/name}', 'comments_url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/709/comments', 'events_url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/709/events', 'html_url': 'https://github.com/aws-amplify/aws-sdk-android/issues/709', 'id': 411001115, 'node_id': 'MDU6SXNzdWU0MTEwMDExMTU=', 'number': 709, 'title': 'Question about transferutility', 'user': {'login': 'ZYHZ100', 'id': 40137626, 'node_id': 'MDQ6VXNlcjQwMTM3NjI2', 'avatar_url': 'https://avatars0.githubusercontent.com/u/40137626?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/ZYHZ100', 'html_url': 'https://github.com/ZYHZ100', 'followers_url': 'https://api.github.com/users/ZYHZ100/followers', 'following_url': 'https://api.github.com/users/ZYHZ100/following{/other_user}', 'gists_url': 'https://api.github.com/users/ZYHZ100/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/ZYHZ100/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/ZYHZ100/subscriptions', 'organizations_url': 'https://api.github.com/users/ZYHZ100/orgs', 'repos_url': 'https://api.github.com/users/ZYHZ100/repos', 'events_url': 'https://api.github.com/users/ZYHZ100/events{/privacy}', 'received_events_url': 'https://api.github.com/users/ZYHZ100/received_events', 'type': 'User', 'site_admin': False}, 'labels': [{'id': 112556447, 'node_id': 'MDU6TGFiZWwxMTI1NTY0NDc=', 'url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/labels/Question', 'name': 'Question', 'color': '58a600', 'default': False}, {'id': 690726530, 'node_id': 'MDU6TGFiZWw2OTA3MjY1MzA=', 'url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/labels/S3', 'name': 'S3', 'color': '607180', 'default': False}], 'state': 'open', 'locked': False, 'assignee': {'login': 'kvasukib', 'id': 15204269, 'node_id': 'MDQ6VXNlcjE1MjA0MjY5', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15204269?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/kvasukib', 'html_url': 'https://github.com/kvasukib', 'followers_url': 'https://api.github.com/users/kvasukib/followers', 'following_url': 'https://api.github.com/users/kvasukib/following{/other_user}', 'gists_url': 'https://api.github.com/users/kvasukib/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/kvasukib/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/kvasukib/subscriptions', 'organizations_url': 'https://api.github.com/users/kvasukib/orgs', 'repos_url': 'https://api.github.com/users/kvasukib/repos', 'events_url': 'https://api.github.com/users/kvasukib/events{/privacy}', 'received_events_url': 'https://api.github.com/users/kvasukib/received_events', 'type': 'User', 'site_admin': False}, 'assignees': [{'login': 'kvasukib', 'id': 15204269, 'node_id': 'MDQ6VXNlcjE1MjA0MjY5', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15204269?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/kvasukib', 'html_url': 'https://github.com/kvasukib', 'followers_url': 'https://api.github.com/users/kvasukib/followers', 'following_url': 'https://api.github.com/users/kvasukib/following{/other_user}', 'gists_url': 'https://api.github.com/users/kvasukib/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/kvasukib/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/kvasukib/subscriptions', 'organizations_url': 'https://api.github.com/users/kvasukib/orgs', 'repos_url': 'https://api.github.com/users/kvasukib/repos', 'events_url': 'https://api.github.com/users/kvasukib/events{/privacy}', 'received_events_url': 'https://api.github.com/users/kvasukib/received_events', 'type': 'User', 'site_admin': False}], 'milestone': None, 'comments': 0, 'created_at': '2019-02-16T00:29:54Z', 'updated_at': '2019-02-18T17:24:40Z', 'closed_at': None, 'author_association': 'NONE', 'body': '**State your question**\r\n\r\nI want to ask when transfer utility is interrupted when there is no network and then it will resume when there is network connected. Can I specify the wifi not data? Thank you~\r\n\r\n**Which AWS Services are you utilizing?**\r\n\r\n**Provide code snippets (if applicable)**\r\n\r\n**Environment(please complete the following information):**\r\n - SDK Version: [e.g. 2.6.25]\r\n\r\n**Device Information (please complete the following information):**\r\n - Device: [e.g. Pixel XL, Simulator]\r\n - Android Version: [e.g. Nougat 7.1.2]\r\n - Specific to simulators:\r\n\r\nIf you need help with understanding how to implement something in particular then we suggest that you first look into our [developer guide](https://docs.aws.amazon.com/aws-mobile/latest/developerguide/aws-mobile-android-and-iOS.html). You can also simplify your process of creating an application, as well as the associated backend setup by using the [Amplify CLI](https://aws-amplify.github.io/media/get_started). \r\n'}, 'comment': {'url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/comments/464818511', 'html_url': 'https://github.com/aws-amplify/aws-sdk-android/issues/709#issuecomment-464818511', 'issue_url': 'https://api.github.com/repos/aws-amplify/aws-sdk-android/issues/709', 'id': 464818511, 'node_id': 'MDEyOklzc3VlQ29tbWVudDQ2NDgxODUxMQ==', 'user': {'login': 'kvasukib', 'id': 15204269, 'node_id': 'MDQ6VXNlcjE1MjA0MjY5', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15204269?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/kvasukib', 'html_url': 'https://github.com/kvasukib', 'followers_url': 'https://api.github.com/users/kvasukib/followers', 'following_url': 'https://api.github.com/users/kvasukib/following{/other_user}', 'gists_url': 'https://api.github.com/users/kvasukib/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/kvasukib/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/kvasukib/subscriptions', 'organizations_url': 'https://api.github.com/users/kvasukib/orgs', 'repos_url': 'https://api.github.com/users/kvasukib/repos', 'events_url': 'https://api.github.com/users/kvasukib/events{/privacy}', 'received_events_url': 'https://api.github.com/users/kvasukib/received_events', 'type': 'User', 'site_admin': False}, 'created_at': '2019-02-18T17:24:40Z', 'updated_at': '2019-02-18T17:24:40Z', 'author_association': 'CONTRIBUTOR', 'body': '@ZYHZ100 Thank you for reporting to us. Yes, this is possible with specifying the type of network connection that can be used to connect to Amazon S3. This feature was introduced in `2.11.0`. \r\n\r\nSee [CHANGELOG](https://github.com/aws-amplify/aws-sdk-android/blob/master/CHANGELOG.md#release-2111) for the release notes on this feature.\r\n\r\nTransferNetworkConnectionType.ANY >>> Any network \r\nTransferNetworkConnectionType.WIFI >>> Wifi only\r\nTransferNetworkConnectionType.MOBILE >>> Mobile Data only\r\n\r\n```java\r\n            TransferUtilityOptions transferUtilityOptions = new TransferUtilityOptions(\r\n                    <num-of-threads>,\r\n                    TransferNetworkConnectionType.WIFI);\r\n            TransferUtility transferUtility = TransferUtility.builder()\r\n                    .context(getApplicationContext())\r\n                    .s3Client(new AmazonS3Client(credentialsProvider, region))\r\n                    .awsConfiguration(new AWSConfiguration(getApplicationContext()))\r\n                    .transferUtilityOptions(transferUtilityOptions)\r\n                    .build();\r\n```'}}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 41077760, 'login': 'aws-amplify', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/aws-amplify', 'avatar_url': 'https://avatars.githubusercontent.com/u/41077760?'}}, {'id': '9088908849', 'type': 'PushEvent', 'actor': {'id': 35246087, 'login': 'johnatanlopes', 'display_login': 'johnatanlopes', 'gravatar_id': '', 'url': 'https://api.github.com/users/johnatanlopes', 'avatar_url': 'https://avatars.githubusercontent.com/u/35246087?'}, 'repo': {'id': 171203835, 'name': 'johnatanlopes/Python-ignorancia-zero', 'url': 'https://api.github.com/repos/johnatanlopes/Python-ignorancia-zero'}, 'payload': {'push_id': 3317993885, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '0c52a8dd5286889e587095aa7cc1622e90c8999e', 'before': 'bacf1a9e772d1869ec2ef1f18ddb343b473bdb53', 'commits': [{'sha': '0c52a8dd5286889e587095aa7cc1622e90c8999e', 'author': {'email': 'johnatanlopes@gmail.com', 'name': 'johnatanlopes'}, 'message': 'Comparações e extendndo objetos', 'distinct': True, 'url': 'https://api.github.com/repos/johnatanlopes/Python-ignorancia-zero/commits/0c52a8dd5286889e587095aa7cc1622e90c8999e'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908843', 'type': 'PushEvent', 'actor': {'id': 37436229, 'login': 'szzd1', 'display_login': 'szzd1', 'gravatar_id': '', 'url': 'https://api.github.com/users/szzd1', 'avatar_url': 'https://avatars.githubusercontent.com/u/37436229?'}, 'repo': {'id': 157712601, 'name': 'szzd1/b', 'url': 'https://api.github.com/repos/szzd1/b'}, 'payload': {'push_id': 3317993882, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '5f2e81802542a6c94c6658952682b275e1610983', 'before': '14a3ed9b1e2acc52a68a0a6ec10fe15813396c00', 'commits': [{'sha': '5f2e81802542a6c94c6658952682b275e1610983', 'author': {'email': '37436229+szzd1@users.noreply.github.com', 'name': 'szzd1'}, 'message': 'Update README.md', 'distinct': True, 'url': 'https://api.github.com/repos/szzd1/b/commits/5f2e81802542a6c94c6658952682b275e1610983'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908841', 'type': 'PushEvent', 'actor': {'id': 25180681, 'login': 'renovate-bot', 'display_login': 'renovate-bot', 'gravatar_id': '', 'url': 'https://api.github.com/users/renovate-bot', 'avatar_url': 'https://avatars.githubusercontent.com/u/25180681?'}, 'repo': {'id': 141736733, 'name': 'renovate-bot/amp-by-example', 'url': 'https://api.github.com/repos/renovate-bot/amp-by-example'}, 'payload': {'push_id': 3317993879, 'size': 0, 'distinct_size': 0, 'ref': 'refs/heads/master', 'head': 'c295c991d9b375309995be63b7da42eaba4af16a', 'before': 'c295c991d9b375309995be63b7da42eaba4af16a', 'commits': []}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908837', 'type': 'PushEvent', 'actor': {'id': 19818937, 'login': 'eneax', 'display_login': 'eneax', 'gravatar_id': '', 'url': 'https://api.github.com/users/eneax', 'avatar_url': 'https://avatars.githubusercontent.com/u/19818937?'}, 'repo': {'id': 171324174, 'name': 'eneax/coffee-shop', 'url': 'https://api.github.com/repos/eneax/coffee-shop'}, 'payload': {'push_id': 3317993877, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '7ff1b4ab2ae1d2dbcc167ca512f9d0749f200944', 'before': 'ccbf4d6c8ba2b6dd6978ccd4a88526405972fd26', 'commits': [{'sha': '7ff1b4ab2ae1d2dbcc167ca512f9d0749f200944', 'author': {'email': '19818937+eneax@users.noreply.github.com', 'name': 'eneax'}, 'message': 'Update logo', 'distinct': True, 'url': 'https://api.github.com/repos/eneax/coffee-shop/commits/7ff1b4ab2ae1d2dbcc167ca512f9d0749f200944'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908839', 'type': 'DeleteEvent', 'actor': {'id': 451344, 'login': 'cameronmalek', 'display_login': 'cameronmalek', 'gravatar_id': '', 'url': 'https://api.github.com/users/cameronmalek', 'avatar_url': 'https://avatars.githubusercontent.com/u/451344?'}, 'repo': {'id': 42189068, 'name': 'cameronmalek/docker-base', 'url': 'https://api.github.com/repos/cameronmalek/docker-base'}, 'payload': {'ref': '0.9.5.1', 'ref_type': 'branch', 'pusher_type': 'user'}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908831', 'type': 'PushEvent', 'actor': {'id': 26875348, 'login': 'delia-rusu', 'display_login': 'delia-rusu', 'gravatar_id': '', 'url': 'https://api.github.com/users/delia-rusu', 'avatar_url': 'https://avatars.githubusercontent.com/u/26875348?'}, 'repo': {'id': 95154596, 'name': 'IBM-Bluemix-Docs/vmwaresolutions', 'url': 'https://api.github.com/repos/IBM-Bluemix-Docs/vmwaresolutions'}, 'payload': {'push_id': 3317993876, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/dr-topic-ids-feb19', 'head': '2cf5bf8a9004d02dff3fb6a5290c7bd6da1b5279', 'before': '2355b7187720a369b98b2acccae1c88aa4ad0061', 'commits': [{'sha': '2cf5bf8a9004d02dff3fb6a5290c7bd6da1b5279', 'author': {'email': 'drusu@ca.ibm.com', 'name': 'delia-rusu'}, 'message': 'Topic ID updates for Feb 19 doc framework changes', 'distinct': True, 'url': 'https://api.github.com/repos/IBM-Bluemix-Docs/vmwaresolutions/commits/2cf5bf8a9004d02dff3fb6a5290c7bd6da1b5279'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 28810603, 'login': 'IBM-Bluemix-Docs', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/IBM-Bluemix-Docs', 'avatar_url': 'https://avatars.githubusercontent.com/u/28810603?'}}, {'id': '9088908832', 'type': 'IssueCommentEvent', 'actor': {'id': 23217074, 'login': 'gbailey46', 'display_login': 'gbailey46', 'gravatar_id': '', 'url': 'https://api.github.com/users/gbailey46', 'avatar_url': 'https://avatars.githubusercontent.com/u/23217074?'}, 'repo': {'id': 74496173, 'name': 'kubernetes/kubeadm', 'url': 'https://api.github.com/repos/kubernetes/kubeadm'}, 'payload': {'action': 'created', 'issue': {'url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/1382', 'repository_url': 'https://api.github.com/repos/kubernetes/kubeadm', 'labels_url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/1382/labels{/name}', 'comments_url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/1382/comments', 'events_url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/1382/events', 'html_url': 'https://github.com/kubernetes/kubeadm/issues/1382', 'id': 405934952, 'node_id': 'MDU6SXNzdWU0MDU5MzQ5NTI=', 'number': 1382, 'title': 'kubeadm panic during phase based init', 'user': {'login': 'tcurdt', 'id': 13697, 'node_id': 'MDQ6VXNlcjEzNjk3', 'avatar_url': 'https://avatars0.githubusercontent.com/u/13697?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/tcurdt', 'html_url': 'https://github.com/tcurdt', 'followers_url': 'https://api.github.com/users/tcurdt/followers', 'following_url': 'https://api.github.com/users/tcurdt/following{/other_user}', 'gists_url': 'https://api.github.com/users/tcurdt/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/tcurdt/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/tcurdt/subscriptions', 'organizations_url': 'https://api.github.com/users/tcurdt/orgs', 'repos_url': 'https://api.github.com/users/tcurdt/repos', 'events_url': 'https://api.github.com/users/tcurdt/events{/privacy}', 'received_events_url': 'https://api.github.com/users/tcurdt/received_events', 'type': 'User', 'site_admin': False}, 'labels': [{'id': 488846147, 'node_id': 'MDU6TGFiZWw0ODg4NDYxNDc=', 'url': 'https://api.github.com/repos/kubernetes/kubeadm/labels/area/UX', 'name': 'area/UX', 'color': 'bfd4f2', 'default': False}, {'id': 486837088, 'node_id': 'MDU6TGFiZWw0ODY4MzcwODg=', 'url': 'https://api.github.com/repos/kubernetes/kubeadm/labels/kind/bug', 'name': 'kind/bug', 'color': 'e11d21', 'default': False}, {'id': 486872444, 'node_id': 'MDU6TGFiZWw0ODY4NzI0NDQ=', 'url': 'https://api.github.com/repos/kubernetes/kubeadm/labels/priority/important-soon', 'name': 'priority/important-soon', 'color': 'eb6420', 'default': False}], 'state': 'open', 'locked': False, 'assignee': {'login': 'neolit123', 'id': 331852, 'node_id': 'MDQ6VXNlcjMzMTg1Mg==', 'avatar_url': 'https://avatars3.githubusercontent.com/u/331852?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/neolit123', 'html_url': 'https://github.com/neolit123', 'followers_url': 'https://api.github.com/users/neolit123/followers', 'following_url': 'https://api.github.com/users/neolit123/following{/other_user}', 'gists_url': 'https://api.github.com/users/neolit123/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/neolit123/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/neolit123/subscriptions', 'organizations_url': 'https://api.github.com/users/neolit123/orgs', 'repos_url': 'https://api.github.com/users/neolit123/repos', 'events_url': 'https://api.github.com/users/neolit123/events{/privacy}', 'received_events_url': 'https://api.github.com/users/neolit123/received_events', 'type': 'User', 'site_admin': False}, 'assignees': [{'login': 'neolit123', 'id': 331852, 'node_id': 'MDQ6VXNlcjMzMTg1Mg==', 'avatar_url': 'https://avatars3.githubusercontent.com/u/331852?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/neolit123', 'html_url': 'https://github.com/neolit123', 'followers_url': 'https://api.github.com/users/neolit123/followers', 'following_url': 'https://api.github.com/users/neolit123/following{/other_user}', 'gists_url': 'https://api.github.com/users/neolit123/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/neolit123/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/neolit123/subscriptions', 'organizations_url': 'https://api.github.com/users/neolit123/orgs', 'repos_url': 'https://api.github.com/users/neolit123/repos', 'events_url': 'https://api.github.com/users/neolit123/events{/privacy}', 'received_events_url': 'https://api.github.com/users/neolit123/received_events', 'type': 'User', 'site_admin': False}], 'milestone': {'url': 'https://api.github.com/repos/kubernetes/kubeadm/milestones/12', 'html_url': 'https://github.com/kubernetes/kubeadm/milestone/12', 'labels_url': 'https://api.github.com/repos/kubernetes/kubeadm/milestones/12/labels', 'id': 3942822, 'node_id': 'MDk6TWlsZXN0b25lMzk0MjgyMg==', 'number': 12, 'title': 'Next', 'description': '', 'creator': {'login': 'timothysc', 'id': 169553, 'node_id': 'MDQ6VXNlcjE2OTU1Mw==', 'avatar_url': 'https://avatars0.githubusercontent.com/u/169553?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/timothysc', 'html_url': 'https://github.com/timothysc', 'followers_url': 'https://api.github.com/users/timothysc/followers', 'following_url': 'https://api.github.com/users/timothysc/following{/other_user}', 'gists_url': 'https://api.github.com/users/timothysc/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/timothysc/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/timothysc/subscriptions', 'organizations_url': 'https://api.github.com/users/timothysc/orgs', 'repos_url': 'https://api.github.com/users/timothysc/repos', 'events_url': 'https://api.github.com/users/timothysc/events{/privacy}', 'received_events_url': 'https://api.github.com/users/timothysc/received_events', 'type': 'User', 'site_admin': False}, 'open_issues': 42, 'closed_issues': 9, 'state': 'open', 'created_at': '2019-01-04T21:14:00Z', 'updated_at': '2019-02-14T17:27:28Z', 'due_on': None, 'closed_at': None}, 'comments': 26, 'created_at': '2019-02-02T01:52:45Z', 'updated_at': '2019-02-18T17:24:40Z', 'closed_at': None, 'author_association': 'NONE', 'body': '## Is this a BUG REPORT or FEATURE REQUEST?\r\n\r\nBUG REPORT\r\n\r\n## Versions\r\n\r\n**kubeadm version** (use `kubeadm version`):\r\n\r\n```\r\nkubeadm version: &version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:05:53Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/arm"}\r\n```\r\n\r\n**Environment**:\r\n- **Kubernetes version** (use `kubectl version`):\r\n```\r\nClient Version: version.Info{Major:"1", Minor:"13", GitVersion:"v1.13.3", GitCommit:"721bfa751924da8d1680787490c54b9179b1fed0", GitTreeState:"clean", BuildDate:"2019-02-01T20:08:12Z", GoVersion:"go1.11.5", Compiler:"gc", Platform:"linux/arm"}\r\nThe connection to the server localhost:8080 was refused - did you specify the right host or port?\r\n```\r\n\r\n- **Cloud provider or hardware configuration**:\r\nRPi3B+\r\n\r\n- **OS** (e.g. from /etc/os-release):\r\n```\r\nPRETTY_NAME="Raspbian GNU/Linux 9 (stretch)"\r\nNAME="Raspbian GNU/Linux"\r\nVERSION_ID="9"\r\nVERSION="9 (stretch)"\r\nID=raspbian\r\nID_LIKE=debian\r\nHOME_URL="http://www.raspbian.org/"\r\nSUPPORT_URL="http://www.raspbian.org/RaspbianForums"\r\nBUG_REPORT_URL="http://www.raspbian.org/RaspbianBugs"\r\nHYPRIOT_OS="HypriotOS/armhf"\r\nHYPRIOT_OS_VERSION="v2.0.1"\r\nHYPRIOT_DEVICE="Raspberry Pi"\r\nHYPRIOT_IMAGE_VERSION="v1.9.0"\r\n```\r\n\r\n- **Kernel** (e.g. `uname -a`):\r\n```\r\nLinux km01 4.14.34-hypriotos-v7+ #1 SMP Sun Apr 22 14:57:31 UTC 2018 armv7l GNU/Linux\r\n```\r\n\r\n- **Others**:\r\n\r\n\r\n## What happened?\r\n\r\nI was trying to work around the race conditions mentioned in #413 and #1380, executing the `kubeadm init` in phases. Instead it crashed on the second call to `init`.\r\n\r\n## What you expected to happen?\r\n\r\nI should see the join information.\r\n\r\n## How to reproduce it (as minimally and precisely as possible)?\r\n\r\nFresh install of hypriotos-rpi-v1.9.0 then:\r\n\r\n```\r\nsudo bash <<EOF\r\ncurl -sSL https://packagecloud.io/Hypriot/rpi/gpgkey | apt-key add -\r\ncurl -sSL https://packages.cloud.google.com/apt/doc/apt-key.gpg | apt-key add -\r\necho "deb http://apt.kubernetes.io/ kubernetes-xenial main" > /etc/apt/sources.list.d/kubernetes.list\r\napt-get update && apt-get install -y kubeadm\r\nsudo kubeadm reset\r\nsudo kubeadm init phase control-plane all --pod-network-cidr 10.244.0.0/16\r\nsudo sed -i \'s/initialDelaySeconds: [0-9][0-9]/initialDelaySeconds: 240/g\' /etc/kubernetes/manifests/kube-apiserver.yaml\r\nsudo sed -i \'s/failureThreshold: [0-9]/failureThreshold: 18/g\'             /etc/kubernetes/manifests/kube-apiserver.yaml\r\nsudo sed -i \'s/timeoutSeconds: [0-9][0-9]/timeoutSeconds: 20/g\'            /etc/kubernetes/manifests/kube-apiserver.yaml\r\nsudo kubeadm init --skip-phases=control-plane --ignore-preflight-errors=all --pod-network-cidr 10.244.0.0/16\r\nEOF\r\n```\r\n\r\n## Anything else we need to know?\r\n\r\nThis is output with the panic information\r\n```\r\n$ sudo kubeadm init --skip-phases=control-plane --ignore-preflight-errors=all --pod-network-cidr 10.244.0.0/16\r\n[init] Using Kubernetes version: v1.13.3\r\n[preflight] Running pre-flight checks\r\n\t[WARNING FileAvailable--etc-kubernetes-manifests-kube-apiserver.yaml]: /etc/kubernetes/manifests/kube-apiserver.yaml already exists\r\n\t[WARNING FileAvailable--etc-kubernetes-manifests-kube-controller-manager.yaml]: /etc/kubernetes/manifests/kube-controller-manager.yaml already exists\r\n\t[WARNING FileAvailable--etc-kubernetes-manifests-kube-scheduler.yaml]: /etc/kubernetes/manifests/kube-scheduler.yaml already exists\r\n\t[WARNING SystemVerification]: this Docker version is not on the list of validated versions: 18.04.0-ce. Latest validated version: 18.06\r\n[preflight] Pulling images required for setting up a Kubernetes cluster\r\n[preflight] This might take a minute or two, depending on the speed of your internet connection\r\n[preflight] You can also perform this action in beforehand using \'kubeadm config images pull\'\r\n[kubelet-start] Writing kubelet environment file with flags to file "/var/lib/kubelet/kubeadm-flags.env"\r\n[kubelet-start] Writing kubelet configuration to file "/var/lib/kubelet/config.yaml"\r\n[kubelet-start] Activating the kubelet service\r\n[certs] Using certificateDir folder "/etc/kubernetes/pki"\r\n[certs] Generating "ca" certificate and key\r\n[certs] Generating "apiserver" certificate and key\r\n[certs] apiserver serving cert is signed for DNS names [km01 kubernetes kubernetes.default kubernetes.default.svc kubernetes.default.svc.cluster.local] and IPs [10.96.0.1 192.168.178.43]\r\n[certs] Generating "apiserver-kubelet-client" certificate and key\r\n[certs] Generating "etcd/ca" certificate and key\r\n[certs] Generating "etcd/server" certificate and key\r\n[certs] etcd/server serving cert is signed for DNS names [km01 localhost] and IPs [192.168.178.43 127.0.0.1 ::1]\r\n[certs] Generating "etcd/peer" certificate and key\r\n[certs] etcd/peer serving cert is signed for DNS names [km01 localhost] and IPs [192.168.178.43 127.0.0.1 ::1]\r\n[certs] Generating "etcd/healthcheck-client" certificate and key\r\n[certs] Generating "apiserver-etcd-client" certificate and key\r\n[certs] Generating "front-proxy-ca" certificate and key\r\n[certs] Generating "front-proxy-client" certificate and key\r\n[certs] Generating "sa" key and public key\r\n[kubeconfig] Using kubeconfig folder "/etc/kubernetes"\r\n[kubeconfig] Writing "admin.conf" kubeconfig file\r\n[kubeconfig] Writing "kubelet.conf" kubeconfig file\r\npanic: runtime error: invalid memory address or nil pointer dereference\r\n[signal SIGSEGV: segmentation violation code=0x1 addr=0x8 pc=0xaab708]\r\n\r\ngoroutine 1 [running]:\r\nk8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig.validateKubeConfig(0xfb953a, 0xf, 0xfc3e7a, 0x17, 0x3034540, 0x68f, 0x7bc)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig/kubeconfig.go:236 +0x120\r\nk8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig.createKubeConfigFileIfNotExists(0xfb953a, 0xf, 0xfc3e7a, 0x17, 0x3034540, 0x0, 0xf8160)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig/kubeconfig.go:257 +0x90\r\nk8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig.createKubeConfigFiles(0xfb953a, 0xf, 0x3144b40, 0x3527c60, 0x1, 0x1, 0x0, 0x0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig/kubeconfig.go:120 +0xf4\r\nk8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig.CreateKubeConfigFile(0xfc3e7a, 0x17, 0xfb953a, 0xf, 0x3144b40, 0x99807501, 0xb9bfcc)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/phases/kubeconfig/kubeconfig.go:93 +0xe8\r\nk8s.io/kubernetes/cmd/kubeadm/app/cmd/phases.runKubeConfigFile.func1(0xf76bc8, 0x32f2ff0, 0x0, 0x0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/kubeconfig.go:155 +0x168\r\nk8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow.(*Runner).Run.func1(0x336ee80, 0x0, 0x0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow/runner.go:235 +0x160\r\nk8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow.(*Runner).visitAll(0x34ecbe0, 0x3527d68, 0x32f2ff0, 0x0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow/runner.go:416 +0x5c\r\nk8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow.(*Runner).Run(0x34ecbe0, 0x24, 0x35bbdb4)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/cmd/phases/workflow/runner.go:208 +0xc8\r\nk8s.io/kubernetes/cmd/kubeadm/app/cmd.NewCmdInit.func1(0x3513400, 0x3227560, 0x0, 0x4)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/cmd/init.go:141 +0xfc\r\nk8s.io/kubernetes/vendor/github.com/spf13/cobra.(*Command).execute(0x3513400, 0x32274c0, 0x4, 0x4, 0x3513400, 0x32274c0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/vendor/github.com/spf13/cobra/command.go:760 +0x20c\r\nk8s.io/kubernetes/vendor/github.com/spf13/cobra.(*Command).ExecuteC(0x3512140, 0x3513400, 0x35123c0, 0x300c8e0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/vendor/github.com/spf13/cobra/command.go:846 +0x210\r\nk8s.io/kubernetes/vendor/github.com/spf13/cobra.(*Command).Execute(0x3512140, 0x300c0d8, 0x117dec0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/vendor/github.com/spf13/cobra/command.go:794 +0x1c\r\nk8s.io/kubernetes/cmd/kubeadm/app.Run(0x3034060, 0x0)\r\n\t/workspace/anago-v1.13.3-beta.0.37+721bfa751924da/src/k8s.io/kubernetes/_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/app/kubeadm.go:48 +0x1b0\r\nmain.main()\r\n\t_output/dockerized/go/src/k8s.io/kubernetes/cmd/kubeadm/kubeadm.go:29 +0x20\r\n```\r\nIt seems like some nil checks are missing https://github.com/kubernetes/kubernetes/blob/v1.13.3/cmd/kubeadm/app/phases/kubeconfig/kubeconfig.go#L236 \r\n\r\n> this can only happen if the kubeconfig phase reads a corrupted kubeconfig file with missing cluster context. possible a side effect of not calling reset.\r\n\r\nBut the kubeconfig file looks OK to me\r\n```\r\n$ sudo cat /etc/kubernetes/admin.conf \r\napiVersion: v1\r\nclusters:\r\n- cluster:\r\n    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1ESXdNakF4TXpBeU5Wb1hEVEk1TURFek1EQXhNekF5TlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUIrCmJ1ckREUGtBR1V5NmM3ZkY5VWI5UlMyRWVqdmx2aHRwRlBGVzVPRGtRL3ZsbFU5b05MR0txdXZjRVVFekJmTnkKcURzQzBsVktoTkFBMWl6TnplZVJEWlRDZ2ZFYitxa3Zib0xGd25hd1A0ZkRKKzVnUndxN0JEM0xYdWNsTFNmeApmczkwb05RaXdYL0hXSjBOUkJZRnN6Zk1iaXZaUSsrRDJjS0FOZm9qSGx2Rm9oU1BqZkVlWmp1NnBtTEhXNlMyCmY4NjJGcnhwSEdOWmhmR3JaTmd1YUFkK0tIM1BCc1IxTThpUFpiMnFjTEN0LzNmMHY2ejc4bUVoL294UC9oUjEKdWVGWmZJWCtpbmxzVXZDM2N3WXZ3VFd6ZnlOT0NSMUJCcUNHRmd4bmt0VVRJd0M3Szc3VHZUcGpnazd5NnAzSQpHMVd3SmVUUERYRXRleGhFTDQwQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFId2NhY0RuK0ZhaldKekJpVExlZmxLeVRSNTgKVm9yKzluZmtMRkNrTWZBcC94b2pwekVKbEJEM0didmh5V21tS2tJNDgvSHZabml1c1g1THNRdXhzamV4bnZTYwppMG9keFZOMTdSOFFiWVovZ0hsREdRanlnYXhvUWN6M1J5MFU3NmJ0U0toQ1VTTko2NEZqeGp1bU9MemVYbkRLCjlsRElPZHZ4VXRXZDVaajc1YmZFRmNyNHJKbEJTK0dZRi9Da2RrdzZtUlpXNCsrYkNPd3RBUGVUemd6bEZtQ1EKZmptM28wQUlNSitvMk9YUjFrRXFlTXo2VDM3b2FsYWNNU1hEeHh1cjBZUmw3NUJ2M2lBOGk0NE5Oei9tNzhOdQpPaW1ONnBVMDFyUWJEVjVBRzJmbndwaURBcGxNbkQ2R0FyZ3R5b3VUREs2ZmlWOXpZaVdkQlBLeFQ5az0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=\r\n    server: https://192.168.178.43:6443\r\n  name: kubernetes\r\ncontexts:\r\n- context:\r\n    cluster: kubernetes\r\n    user: kubernetes-admin\r\n  name: kubernetes-admin@kubernetes\r\ncurrent-context: kubernetes-admin@kubernetes\r\nkind: Config\r\npreferences: {}\r\nusers:\r\n- name: kubernetes-admin\r\n  user:\r\n    client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJYk4rZTR0WFh4and3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB4T1RBeU1ESXdNVE13TWpWYUZ3MHlNREF5TURJd01UTXlNRFJhTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXBnMzBYR0h4U1IwMWdLMGEKc3FFb1hTanFJNXloZVErZ21YcWNJeDRMYUNIWVZJM2VZc29SbTVSTCtDYTNRblJ5aE4vSHVvMkJYUE1MdGlIZwpIR1BlL3VKRkRHOHJxa2xVbHZZSXZDMkE4QVpLVENEUzBFRmNoQ0RhOHhDMGVQUG9jbXdLWTdVRHFkWGIvY2RHCk8yZG9LaWJLeGtGM3dEWjVCUXR4VXgzTDB1bWZDVFFNOWlQYk00aHF3N3N0Rzc5SXE1dUZXU1VxMFNRb0tad0oKbDFzRXpCQ3kveGV2bWIvTG1jLzR5QTVRVGNPK09yejFTdUZReVRxN0NIb1g1T1ZadDRqbk9jQUZpdFhDbWFROAp3OW0wRERvanJLakVrWlZNL1M4aWY3T3hUZ1d5MDVkaGE4VWZ2TStHaFBmVTF1cEJqdFJGcXB2VUIySkp6UEFmCnl4cFJCUUlEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFFcmRYbEhyb2w1a0NQR1UyYUNJOUE5a3NuL0k2a1l3RlR6RAo5NFprNVFSQVhUNjlqSy9namY3c3dNL1JxY1RpRnNFQnY0bXpzeGRjNnBydXdHbytab1o3V2VGTTAvNFJNcFZJCm1qVitKbWdlNk14WUkyMWhOZnMydjNNN2RnbVpMRjJsN25yRTNMTVpiMHZMdUJuN2ZKZWxXb0lGSDd3WWFnQnIKeFlWVzZjYzJtWkkzWHVxYTcraWpjNHpJdmpDSjR6cTFiRUdSUlNEQWNwbjhnQjFXWXRoUWd2cHV0cGZGTGlDTApIK0dya1ZCR3FEY3VVbFRJMkJlZXVMMUduRXJsQzYremhDZnY1VStGR2pwS2RwaVN6UkV4T1F4bEJJOEYzQnZVCnp0VTRVVkR3S24vYUFOUm01N3d6dHlTL0FyOGJQUlRrR0psbGpOZVE0bEd1cWtFQTJKaz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=\r\n    client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBcGczMFhHSHhTUjAxZ0swYXNxRW9YU2pxSTV5aGVRK2dtWHFjSXg0TGFDSFlWSTNlCllzb1JtNVJMK0NhM1FuUnloTi9IdW8yQlhQTUx0aUhnSEdQZS91SkZERzhycWtsVWx2WUl2QzJBOEFaS1RDRFMKMEVGY2hDRGE4eEMwZVBQb2Ntd0tZN1VEcWRYYi9jZEdPMmRvS2liS3hrRjN3RFo1QlF0eFV4M0wwdW1mQ1RRTQo5aVBiTTRocXc3c3RHNzlJcTV1RldTVXEwU1FvS1p3Smwxc0V6QkN5L3hldm1iL0xtYy80eUE1UVRjTytPcnoxClN1RlF5VHE3Q0hvWDVPVlp0NGpuT2NBRml0WENtYVE4dzltMEREb2pyS2pFa1pWTS9TOGlmN094VGdXeTA1ZGgKYThVZnZNK0doUGZVMXVwQmp0UkZxcHZVQjJKSnpQQWZ5eHBSQlFJREFRQUJBb0lCQURsWFlrV3drS2lsekg3MQp4OTFkWjFuY01oWkFGVVovemY2UjUyNzlCZ1ZjZ3A2WUt1NUVSeFpKZkg1aHFERHJrMHd0Rm9SbUx3RFE4UDlnCjdVb0FkdFhmZnVhUFVTM0ppc3RpaEp1dXZ2S2p5VzVHZTJYczNDeklSN05kMW1SYUhhKzlmVXozQ2gvUXVOb0cKd1Vyc0ozMCt6aER1TkpNTWZIZndmcDZzRUdGeE9yYnN5WWE3S0l1RWxuQ0FHWXQwalpjcmw2OENKcVJnZEhEbwpwRFZCL2Zub0ZBZi82Ym9Ga1JTckJkeUM5clpqYlZRbmtwT0VpQ0JONCtMS3RIRjlhUXhELytJWXRVeWFrb2tLClNJNWVTZEhhbkl0U2hxaTVCQmtjV3c5cmdhZDJjYWE5TjRMR1Q1N29LSFJmSFV2T1phTDlGZC9xbjJlb285RlAKTXplcVdCVUNnWUVBeGk5Y3FIOEo1eHFmWUlpRXU2Ly9HTjZETXo0ZWlaSUZNRGdzWjhRR21Fc0hhd1ZZWHlRRwpQNjVES0p1ZUI3SWk1eHV2Z2tGR2JJVnBBMmRleEo2YzhtQmo4N2Zoa2s5SGxDb1VpcDBEdU9uVnJJTVR5Uk02CkR5QWNQaUw2MEY4cGFoU2htZ21USHdXYS81N1Vscllxc1N6RW4vVDBuVFFwQ09uYVJFTlVvTzhDZ1lFQTFuOE8Kdkk1OGx4MzBOSTg3UXV3eVNoMmxKUG04bnJUc0ZBbXRNNXB6Z1ovaUc5TUVGU0V0RzZLbnBuNlRrQjR0YzEzQgpiN01SVWZWY0RIQTRwS09TNk1DZHVoTmJLN3pmNjNOMFpMeWtMdzN2aExRYlhrRlBScEtEQm0rc3J2M0V1MEVnCnQwODNSKzdaMjV1aGhYa2I4WU9kaTZpQXk1VytMS2FPRzh0OWhVc0NnWUVBc2dDeUdZalk3U0NsUzMveXI5ejQKbzI2ZnFyTzltOVJ5SW9naG9pV1h3c3VJNHgvTzZzMGhhNnJxR1J3RWlXYi9JRkptaGZoNDkxbXdJMldCNGRtUQpuOFhob0hKbEFST0I5OXIveml3T3Z0UVBuYjJ4VktXWFBTU2JHVmd6ckZuOGlaSDBQN1VmMWZvajZEblJPWGh1CnllbXF4UHl2aEU3b0dHQnFNV3ZFSkRNQ2dZQVYxV01ib0dsZ1BJVlNJRTVJOXAvNzJWNnBEOTY2VFBKRzYrRTgKZ25sRmRZL2ZnekJFTWxkVUc4OXk3Q2w3SHdkRFdnVEpxUEdYWlNGVWhzdk5QblZDeWZDRU0xb3hibzFnZXlVYQo1L1RTY1ZtektWNHJ6dndSMC9JUVlxZXlQRlNkTnZqc2o5eXhyc2R3U2p3N3lPTW1SMTV2Qzl6b1hEcTZjczIrCldJMVRWd0tCZ1FDbWRpeG9nTXM0WkR3dFl4c3BBZzRqYUdRMURJck52bWJEcEl4eFhYNXBqSmFSWXU2VnljZk0KQkZJZmFtTkJpODNadDBIWkdERkdOdUdCSEJFTys4L1k4NWZDNWgySlM0MTBjUGhoVkoxWSs5Q0NpOGgzREZ2Swo5SWRzNkR0MUlCRFlsejFuV2p4cVcyb01zaGxZSy9BSkpYbGxRVXR3ZEJhczc4bkRvdkplYWc9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=\r\n```'}, 'comment': {'url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/comments/464818508', 'html_url': 'https://github.com/kubernetes/kubeadm/issues/1382#issuecomment-464818508', 'issue_url': 'https://api.github.com/repos/kubernetes/kubeadm/issues/1382', 'id': 464818508, 'node_id': 'MDEyOklzc3VlQ29tbWVudDQ2NDgxODUwOA==', 'user': {'login': 'gbailey46', 'id': 23217074, 'node_id': 'MDQ6VXNlcjIzMjE3MDc0', 'avatar_url': 'https://avatars1.githubusercontent.com/u/23217074?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/gbailey46', 'html_url': 'https://github.com/gbailey46', 'followers_url': 'https://api.github.com/users/gbailey46/followers', 'following_url': 'https://api.github.com/users/gbailey46/following{/other_user}', 'gists_url': 'https://api.github.com/users/gbailey46/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/gbailey46/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/gbailey46/subscriptions', 'organizations_url': 'https://api.github.com/users/gbailey46/orgs', 'repos_url': 'https://api.github.com/users/gbailey46/repos', 'events_url': 'https://api.github.com/users/gbailey46/events{/privacy}', 'received_events_url': 'https://api.github.com/users/gbailey46/received_events', 'type': 'User', 'site_admin': False}, 'created_at': '2019-02-18T17:24:40Z', 'updated_at': '2019-02-18T17:24:40Z', 'author_association': 'NONE', 'body': 'Yes it works repeatedly.\r\nI realised that the controller-manager.conf and scheduler.conf file were 0 bytes and that the init would use an existing file (and CA) if one already existed, hence potentially skipping the file create/write that seems to segfault.\r\nOn a whim I tried --dry-run and it completed without segfault. So I used the relevant CA and .conf from the --dry-run.'}}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 13629408, 'login': 'kubernetes', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/kubernetes', 'avatar_url': 'https://avatars.githubusercontent.com/u/13629408?'}}, {'id': '9088908816', 'type': 'PushEvent', 'actor': {'id': 898095, 'login': 'digitalbricklayer', 'display_login': 'digitalbricklayer', 'gravatar_id': '', 'url': 'https://api.github.com/users/digitalbricklayer', 'avatar_url': 'https://avatars.githubusercontent.com/u/898095?'}, 'repo': {'id': 33550669, 'name': 'digitalbricklayer/workbench', 'url': 'https://api.github.com/repos/digitalbricklayer/workbench'}, 'payload': {'push_id': 3317993863, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/feature/bundle', 'head': '47db8ae252825ae7ce4873aefbdf2a227c41c298', 'before': '5231e5bfc90101e777c12902e13469cecaf7db37', 'commits': [{'sha': '47db8ae252825ae7ce4873aefbdf2a227c41c298', 'author': {'email': 'jhughes@openxtra.co.uk', 'name': 'Jack Hughes'}, 'message': 'Creates a new solver interface and adds an unimplemented AC-1 solver.', 'distinct': True, 'url': 'https://api.github.com/repos/digitalbricklayer/workbench/commits/47db8ae252825ae7ce4873aefbdf2a227c41c298'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908813', 'type': 'CreateEvent', 'actor': {'id': 10330923, 'login': 'amishshah', 'display_login': 'amishshah', 'gravatar_id': '', 'url': 'https://api.github.com/users/amishshah', 'avatar_url': 'https://avatars.githubusercontent.com/u/10330923?'}, 'repo': {'id': 171165243, 'name': 'amishshah/ytdl-core-discord', 'url': 'https://api.github.com/repos/amishshah/ytdl-core-discord'}, 'payload': {'ref': 'v1.0.2', 'ref_type': 'tag', 'master_branch': 'master', 'description': 'A ytdl-core wrapper focused on efficiency for use in Discord music bots', 'pusher_type': 'user'}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908809', 'type': 'DeleteEvent', 'actor': {'id': 43915749, 'login': 'Cliftonz', 'display_login': 'Cliftonz', 'gravatar_id': '', 'url': 'https://api.github.com/users/Cliftonz', 'avatar_url': 'https://avatars.githubusercontent.com/u/43915749?'}, 'repo': {'id': 167196387, 'name': 'IUS-CS/3MasterGames', 'url': 'https://api.github.com/repos/IUS-CS/3MasterGames'}, 'payload': {'ref': 'Johnny', 'ref_type': 'branch', 'pusher_type': 'user'}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 29818878, 'login': 'IUS-CS', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/IUS-CS', 'avatar_url': 'https://avatars.githubusercontent.com/u/29818878?'}}, {'id': '9088908808', 'type': 'PullRequestEvent', 'actor': {'id': 15165030, 'login': 'RamyAllam', 'display_login': 'RamyAllam', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'avatar_url': 'https://avatars.githubusercontent.com/u/15165030?'}, 'repo': {'id': 171325045, 'name': 'RamyAllam/devops-essentials-sample-app', 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app'}, 'payload': {'action': 'closed', 'number': 1, 'pull_request': {'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1', 'id': 253993985, 'node_id': 'MDExOlB1bGxSZXF1ZXN0MjUzOTkzOTg1', 'html_url': 'https://github.com/RamyAllam/devops-essentials-sample-app/pull/1', 'diff_url': 'https://github.com/RamyAllam/devops-essentials-sample-app/pull/1.diff', 'patch_url': 'https://github.com/RamyAllam/devops-essentials-sample-app/pull/1.patch', 'issue_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/1', 'number': 1, 'state': 'closed', 'locked': False, 'title': 'change text to state that devops is awesome', 'user': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'body': '', 'created_at': '2019-02-18T17:24:19Z', 'updated_at': '2019-02-18T17:24:39Z', 'closed_at': '2019-02-18T17:24:39Z', 'merged_at': '2019-02-18T17:24:39Z', 'merge_commit_sha': 'ba255c61a1860553d45af7e71fec3a591a7564c4', 'assignee': None, 'assignees': [], 'requested_reviewers': [], 'requested_teams': [], 'labels': [], 'milestone': None, 'commits_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1/commits', 'review_comments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1/comments', 'review_comment_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/comments{/number}', 'comments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/1/comments', 'statuses_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/statuses/02fc50084a6483f16828fcc98c0a086797d0d764', 'head': {'label': 'RamyAllam:new-feature', 'ref': 'new-feature', 'sha': '02fc50084a6483f16828fcc98c0a086797d0d764', 'user': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'repo': {'id': 171325045, 'node_id': 'MDEwOlJlcG9zaXRvcnkxNzEzMjUwNDU=', 'name': 'devops-essentials-sample-app', 'full_name': 'RamyAllam/devops-essentials-sample-app', 'private': False, 'owner': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'html_url': 'https://github.com/RamyAllam/devops-essentials-sample-app', 'description': None, 'fork': True, 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app', 'forks_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/forks', 'keys_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/keys{/key_id}', 'collaborators_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/collaborators{/collaborator}', 'teams_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/teams', 'hooks_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/hooks', 'issue_events_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/events{/number}', 'events_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/events', 'assignees_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/assignees{/user}', 'branches_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/branches{/branch}', 'tags_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/tags', 'blobs_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/blobs{/sha}', 'git_tags_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/tags{/sha}', 'git_refs_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/refs{/sha}', 'trees_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/trees{/sha}', 'statuses_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/statuses/{sha}', 'languages_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/languages', 'stargazers_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/stargazers', 'contributors_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/contributors', 'subscribers_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/subscribers', 'subscription_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/subscription', 'commits_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/commits{/sha}', 'git_commits_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/commits{/sha}', 'comments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/comments{/number}', 'issue_comment_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/comments{/number}', 'contents_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/contents/{+path}', 'compare_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/compare/{base}...{head}', 'merges_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/merges', 'archive_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/{archive_format}{/ref}', 'downloads_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/downloads', 'issues_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues{/number}', 'pulls_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls{/number}', 'milestones_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/milestones{/number}', 'notifications_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/notifications{?since,all,participating}', 'labels_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/labels{/name}', 'releases_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/releases{/id}', 'deployments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/deployments', 'created_at': '2019-02-18T17:16:40Z', 'updated_at': '2019-02-18T17:16:42Z', 'pushed_at': '2019-02-18T17:24:39Z', 'git_url': 'git://github.com/RamyAllam/devops-essentials-sample-app.git', 'ssh_url': 'git@github.com:RamyAllam/devops-essentials-sample-app.git', 'clone_url': 'https://github.com/RamyAllam/devops-essentials-sample-app.git', 'svn_url': 'https://github.com/RamyAllam/devops-essentials-sample-app', 'homepage': None, 'size': 53, 'stargazers_count': 0, 'watchers_count': 0, 'language': 'HTML', 'has_issues': False, 'has_projects': True, 'has_downloads': True, 'has_wiki': True, 'has_pages': False, 'forks_count': 0, 'mirror_url': None, 'archived': False, 'open_issues_count': 0, 'license': None, 'forks': 0, 'open_issues': 0, 'watchers': 0, 'default_branch': 'master'}}, 'base': {'label': 'RamyAllam:master', 'ref': 'master', 'sha': 'dc95c531307bb3df387145a7b93a6f2e9ad0a872', 'user': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'repo': {'id': 171325045, 'node_id': 'MDEwOlJlcG9zaXRvcnkxNzEzMjUwNDU=', 'name': 'devops-essentials-sample-app', 'full_name': 'RamyAllam/devops-essentials-sample-app', 'private': False, 'owner': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'html_url': 'https://github.com/RamyAllam/devops-essentials-sample-app', 'description': None, 'fork': True, 'url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app', 'forks_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/forks', 'keys_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/keys{/key_id}', 'collaborators_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/collaborators{/collaborator}', 'teams_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/teams', 'hooks_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/hooks', 'issue_events_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/events{/number}', 'events_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/events', 'assignees_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/assignees{/user}', 'branches_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/branches{/branch}', 'tags_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/tags', 'blobs_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/blobs{/sha}', 'git_tags_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/tags{/sha}', 'git_refs_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/refs{/sha}', 'trees_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/trees{/sha}', 'statuses_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/statuses/{sha}', 'languages_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/languages', 'stargazers_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/stargazers', 'contributors_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/contributors', 'subscribers_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/subscribers', 'subscription_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/subscription', 'commits_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/commits{/sha}', 'git_commits_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/git/commits{/sha}', 'comments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/comments{/number}', 'issue_comment_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/comments{/number}', 'contents_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/contents/{+path}', 'compare_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/compare/{base}...{head}', 'merges_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/merges', 'archive_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/{archive_format}{/ref}', 'downloads_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/downloads', 'issues_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues{/number}', 'pulls_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls{/number}', 'milestones_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/milestones{/number}', 'notifications_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/notifications{?since,all,participating}', 'labels_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/labels{/name}', 'releases_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/releases{/id}', 'deployments_url': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/deployments', 'created_at': '2019-02-18T17:16:40Z', 'updated_at': '2019-02-18T17:16:42Z', 'pushed_at': '2019-02-18T17:24:39Z', 'git_url': 'git://github.com/RamyAllam/devops-essentials-sample-app.git', 'ssh_url': 'git@github.com:RamyAllam/devops-essentials-sample-app.git', 'clone_url': 'https://github.com/RamyAllam/devops-essentials-sample-app.git', 'svn_url': 'https://github.com/RamyAllam/devops-essentials-sample-app', 'homepage': None, 'size': 53, 'stargazers_count': 0, 'watchers_count': 0, 'language': 'HTML', 'has_issues': False, 'has_projects': True, 'has_downloads': True, 'has_wiki': True, 'has_pages': False, 'forks_count': 0, 'mirror_url': None, 'archived': False, 'open_issues_count': 0, 'license': None, 'forks': 0, 'open_issues': 0, 'watchers': 0, 'default_branch': 'master'}}, '_links': {'self': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1'}, 'html': {'href': 'https://github.com/RamyAllam/devops-essentials-sample-app/pull/1'}, 'issue': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/1'}, 'comments': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/issues/1/comments'}, 'review_comments': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1/comments'}, 'review_comment': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/comments{/number}'}, 'commits': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/pulls/1/commits'}, 'statuses': {'href': 'https://api.github.com/repos/RamyAllam/devops-essentials-sample-app/statuses/02fc50084a6483f16828fcc98c0a086797d0d764'}}, 'author_association': 'OWNER', 'merged': True, 'mergeable': None, 'rebaseable': None, 'mergeable_state': 'unknown', 'merged_by': {'login': 'RamyAllam', 'id': 15165030, 'node_id': 'MDQ6VXNlcjE1MTY1MDMw', 'avatar_url': 'https://avatars3.githubusercontent.com/u/15165030?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/RamyAllam', 'html_url': 'https://github.com/RamyAllam', 'followers_url': 'https://api.github.com/users/RamyAllam/followers', 'following_url': 'https://api.github.com/users/RamyAllam/following{/other_user}', 'gists_url': 'https://api.github.com/users/RamyAllam/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/RamyAllam/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/RamyAllam/subscriptions', 'organizations_url': 'https://api.github.com/users/RamyAllam/orgs', 'repos_url': 'https://api.github.com/users/RamyAllam/repos', 'events_url': 'https://api.github.com/users/RamyAllam/events{/privacy}', 'received_events_url': 'https://api.github.com/users/RamyAllam/received_events', 'type': 'User', 'site_admin': False}, 'comments': 0, 'review_comments': 0, 'maintainer_can_modify': False, 'commits': 1, 'additions': 2, 'deletions': 2, 'changed_files': 1}}, 'public': True, 'created_at': '2019-02-18T17:24:40Z'}, {'id': '9088908797', 'type': 'PushEvent', 'actor': {'id': 11527041, 'login': 'tyson-swetnam', 'display_login': 'tyson-swetnam', 'gravatar_id': '', 'url': 'https://api.github.com/users/tyson-swetnam', 'avatar_url': 'https://avatars.githubusercontent.com/u/11527041?'}, 'repo': {'id': 168772777, 'name': 'CyVerse-learning-materials/container_camp_workshop_2019', 'url': 'https://api.github.com/repos/CyVerse-learning-materials/container_camp_workshop_2019'}, 'payload': {'push_id': 3317993857, 'size': 1, 'distinct_size': 1, 'ref': 'refs/heads/master', 'head': '6cb3bf30c5808ca8dfc54ef4c8d153cb5a935fe1', 'before': '2b16680037f6ee05e722c6850a940a755aa26bb1', 'commits': [{'sha': '6cb3bf30c5808ca8dfc54ef4c8d153cb5a935fe1', 'author': {'email': 'tyson-swetnam@users.noreply.github.com', 'name': 'Tyson L. Swetnam'}, 'message': 'Update agenda.rst', 'distinct': True, 'url': 'https://api.github.com/repos/CyVerse-learning-materials/container_camp_workshop_2019/commits/6cb3bf30c5808ca8dfc54ef4c8d153cb5a935fe1'}]}, 'public': True, 'created_at': '2019-02-18T17:24:40Z', 'org': {'id': 23200807, 'login': 'CyVerse-learning-materials', 'gravatar_id': '', 'url': 'https://api.github.com/orgs/CyVerse-learning-materials', 'avatar_url': 'https://avatars.githubusercontent.com/u/23200807?'}}, {'id': '9088908792', 'type': 'ReleaseEvent', 'actor': {'id': 10330923, 'login': 'amishshah', 'display_login': 'amishshah', 'gravatar_id': '', 'url': 'https://api.github.com/users/amishshah', 'avatar_url': 'https://avatars.githubusercontent.com/u/10330923?'}, 'repo': {'id': 171165243, 'name': 'amishshah/ytdl-core-discord', 'url': 'https://api.github.com/repos/amishshah/ytdl-core-discord'}, 'payload': {'action': 'published', 'release': {'url': 'https://api.github.com/repos/amishshah/ytdl-core-discord/releases/15625652', 'assets_url': 'https://api.github.com/repos/amishshah/ytdl-core-discord/releases/15625652/assets', 'upload_url': 'https://uploads.github.com/repos/amishshah/ytdl-core-discord/releases/15625652/assets{?name,label}', 'html_url': 'https://github.com/amishshah/ytdl-core-discord/releases/tag/v1.0.2', 'id': 15625652, 'node_id': 'MDc6UmVsZWFzZTE1NjI1NjUy', 'tag_name': 'v1.0.2', 'target_commitish': 'master', 'name': 'v1.0.2', 'draft': False, 'author': {'login': 'amishshah', 'id': 10330923, 'node_id': 'MDQ6VXNlcjEwMzMwOTIz', 'avatar_url': 'https://avatars1.githubusercontent.com/u/10330923?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/amishshah', 'html_url': 'https://github.com/amishshah', 'followers_url': 'https://api.github.com/users/amishshah/followers', 'following_url': 'https://api.github.com/users/amishshah/following{/other_user}', 'gists_url': 'https://api.github.com/users/amishshah/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/amishshah/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/amishshah/subscriptions', 'organizations_url': 'https://api.github.com/users/amishshah/orgs', 'repos_url': 'https://api.github.com/users/amishshah/repos', 'events_url': 'https://api.github.com/users/amishshah/events{/privacy}', 'received_events_url': 'https://api.github.com/users/amishshah/received_events', 'type': 'User', 'site_admin': False}, 'prerelease': False, 'created_at': '2019-02-18T17:23:13Z', 'published_at': '2019-02-18T17:24:39Z', 'assets': [], 'tarball_url': 'https://api.github.com/repos/amishshah/ytdl-core-discord/tarball/v1.0.2', 'zipball_url': 'https://api.github.com/repos/amishshah/ytdl-core-discord/zipball/v1.0.2', 'body': '- Fix livestream detection (2e161fe3f6a462d7d55c368db5853d9f928d5b94)\r\n- Fix livestreams ending early (d80d565984eef7f924afa62636fcfe796d59083b)'}}, 'public': True, 'created_at': '2019-02-18T17:24:39Z'}]

*** 原始响应内容
    我希望从服务器获取原始套接字响应。
#+BEGIN_SRC python :results output :session
  requests.get('https://api.github.com/events',stream=True)
  print(r.raw)
#+END_SRC

#+RESULTS:
: <urllib3.response.HTTPResponse object at 0x7f08e54d1e80>
